<template>
    <div class="index">
      <about-info style="margin-top: 20px"/>
      <div style="padding: 20px 100px 0px 100px">
        <ve-line :data="chartData"></ve-line>
      </div>
    </div>
</template>

<script>
import AboutInfo from './components/AboutInfo'
export default {
  components: {
    AboutInfo
  },
  data: function () {
    return {
      chartData: {
        columns: ['日期', '接受用户', '回复用户', '回复率'],
        rows: [
          { '日期': '01-01', '接受用户': 1393, '回复用户': 1093, '回复率': 0.32 },
          { '日期': '01-02', '接受用户': 3530, '回复用户': 3230, '回复率': 0.26 },
          { '日期': '01-03', '接受用户': 2923, '回复用户': 2623, '回复率': 0.76 },
          { '日期': '01-04', '接受用户': 1723, '回复用户': 1423, '回复率': 0.49 },
          { '日期': '01-05', '接受用户': 3792, '回复用户': 3492, '回复率': 0.323 },
          { '日期': '01-06', '接受用户': 4593, '回复用户': 4293, '回复率': 0.78 },
          { '日期': '01-07', '接受用户': 1393, '回复用户': 1093, '回复率': 0.32 },
          { '日期': '01-08', '接受用户': 3530, '回复用户': 3230, '回复率': 0.26 },
          { '日期': '01-09', '接受用户': 2923, '回复用户': 2623, '回复率': 0.76 },
          { '日期': '01-10', '接受用户': 1723, '回复用户': 1423, '回复率': 0.49 },
          { '日期': '01-11', '接受用户': 3792, '回复用户': 3492, '回复率': 0.323 },
          { '日期': '01-12', '接受用户': 4593, '回复用户': 4293, '回复率': 0.78 },
          { '日期': '01-13', '接受用户': 1393, '回复用户': 1093, '回复率': 0.32 },
          { '日期': '01-14', '接受用户': 3530, '回复用户': 3230, '回复率': 0.26 },
          { '日期': '01-15', '接受用户': 2923, '回复用户': 2623, '回复率': 0.76 },
          { '日期': '01-16', '接受用户': 1723, '回复用户': 1423, '回复率': 0.49 },
          { '日期': '01-17', '接受用户': 3792, '回复用户': 3492, '回复率': 0.323 },
          { '日期': '01-18', '接受用户': 4593, '回复用户': 4293, '回复率': 0.78 }
        ]
      }
    }
  }
}
</script>

<style scoped lang="less">

</style>
